app/controllers/songs_controller.rb

  def index
    if params[:artist_id]

      begin
        @songs = Artist.find(params[:artist_id]).songs
      rescue # if the db cannot find the artist id then redirect
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end

    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if !params[:artist_id].nil?
      @artist = Artist.find(params[:artist_id])
      #redirect_to artists_path if @artist.nil?

      @song = @artist.songs.detect {|s| s.id == params[:id].to_i}
      if @song.nil?
        flash[:alert] = "Song not found"
        redirect_to artist_songs_path(@artist)
      end
    else
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]